# Welcome to Lab Session 9 - Derek Thomas - 18Nov2017

## Argument Framework

Claim
Santa Clara University's MSIS graduates are the best resources for Recruiters of the Top Silicon Valley IT Companies. 

Warrants
- Since Santa Clara University Undergraduate enrollees have the highest average SAT scores, the graduates are highly skilled and suitable for employment in the fileds of their specialty.
- Since Santa Clara University University has the only MSIS program in Silicon Valley, their graduates are better suited for employment in the top occupations.
- Since the MSIS curriculum offers courses that directly support 7 of the top 10 of 50 best job occupations for 2017, as ranked by Money Magazine, their graduates are best suited for employment
- Santa Clara University ranks in the top ten percentile of California colleges for applicants with high average SAT percentage (SAT_AVG)
    - It is inferred that if the University has a high number of applicants with higher than average SAT scores, the classroom discussions will be at a level more conducive to learning, and increae the overall effectiveness of the degree program.
----------------------------------
- Sanata Clara University ranks in the top ten percentile of California colleges in the percentage of degrees awarded in Computer and Information Systems (PCIP11)
    - The assumption is that if the University has awarded a higher number of degrees in Computers and Information Systems over similar programs, the University has prioritized this field of study, invested sufficient resources in this area to include quality faculty, and will produce a better MSIS program 
----------------------------------
- Santa Clara University ranks in the top ten percentile of California colleges for its degree completion rate for first-time, full-time students (C150_4)
    - This will support and contribute to recruiting effectiveness by assuring prospective students that the University has among the highest completion rate of students who start the program, inferring that the program is of high quality to retain enrolled students.
----------------------------------
- In relation to student body size, Santa Clara University rates in the top ten percentile of its number of graduate students (GRADS)
    - This is supported by the inference that high numbers of graduate students translate into successful reputable degree programs

Evidence
- D1_50BestJobs2017.csv - Dataset contains the 50 top job occupations for 2017
    - This Dataset is not used in the current iteration, but reserved for later use
---------------------------------
- D2_SCUMSISTracks.csv - Dataset contains the Santa Clara University MSIS program main concentration Tracks
    - This Dataset is not used in the current iteration, but reserved for later use
---------------------------------
- D3_SCUMSISCourses.csv - Dataset contains the Santa Clara University MSIS curriculum offered as of Oct 2017
    - This Dataset is not used in the current iteration, but reserved for later use
---------------------------------
- D4_CollegeScorecard201516.csv - Dataset contains a comprehensive listing of all Colleges/Universities and various statistics
    - The Dataset is filtered to include only the California Colleges/Universities and will connect to the "50-best Colleges" Dataset (D5) based on College/University Name
---------------------------------
- D5_50BestColleges2017.csv - Dataset contains the top 50 U.S. Colleges/Universities for Business Majors
    - The Dataset has been filtered to only include California Colleges/Universites

Audience
- Job Recruiters

Audience Needs
- Quality Job applicants
- Meeting of placement Quotas
Audience Wants
- Screened Applicant Pool with respect to quality
Audience Fears
- Placememt pf am unqualified applicant
- Failure to meet placement Quotas
- Planning Data

Metrics
- Ranking of Santa Clara Universitys average SAT scores to that of other Universities offfering MSIS curriculum
- Curriculum coverage of meets top 10 of 2017 Best Job Occupations
- 1 of 1 Universities related in Silicon Valley that offer an MSIS program

Warrants
 - The SAT averages, percentage of degrees awarded in Computer & Information Systems, and Completion rate for first-time, full-time students are based on Undergraduate statistics and may not ncecessarily translate to the College/University graduate programs

## Define & setup the environment

In [16]:
import pandas as pd
import numpy as np
#import pandas_datareader as pdr
#from pandas_datareader import data, wb
#import urllib3
#http = urllib3.PoolManager()
import string
import re
import json
#from collections import OrderedDict
import warnings
warnings.filterwarnings('ignore')

## Import various Datasets to be used in SCU MSIS Dashboard

### Dataset-1 is a list of 50 Best for Jobs in America for 2017 compiled by Glassdoor
Reference: https://www.glassdoor.com/List/Best-Jobs-in-America-LST_KQ0,20.htm

Raw Dataset-1 prior to scraping:

![50-Best-Jobs-2017_Raw.png](attachment:50-Best-Jobs-2017_Raw.png)

Dataset-1 utilizing Excel formulas as a means to scrape raw data and capure Dataset-1:

![50-Best-Jobs-2017_Scrape-1.png](attachment:50-Best-Jobs-2017_Scrape-1.png)

Dataset-1 Final result after Excel Scraping

![50-Best-Jobs-2017_Final-1.png](attachment:50-Best-Jobs-2017_Final-1.png)

#### Dataset-1 - Read in "50 Best Jobs in 2017"

In [17]:
dfJobs = pd.read_excel('50-Best-Jobs-2017.xlsx', sheetname='Final', header=0)
dfJobs.head(4)

,Ranking,Occupation,Job Score,Job Satisfaction,Median Base Salary,Job Openings
0,1,Data Scientist,4.8,4.4,110000,4184
1,2,DevOps Engineer,4.7,4.2,110000,2725
2,3,Data Engineer,4.7,4.3,106000,2599
3,4,Tax Manager,4.7,4.0,110000,3317

#### Add new column as Primary Key and reset index to this new column - 'Occuptation ID'

In [18]:
dfJobs['Occupation ID'] = ''
i = 0
for row in dfJobs['Ranking']:
    if (i < 9):
        dfJobs['Occupation ID'][i] = ('OCC_0' + str(i+1))
    else:
        dfJobs['Occupation ID'][i] = ('OCC_' + str(i+1))
    i = i + 1
dfJobs = dfJobs.set_index('Occupation ID')
dfJobs.head(4)

,Ranking,Occupation,Job Score,Job Satisfaction,Median Base Salary,Job Openings
Occupation ID,,,,,,
OCC_01,1,Data Scientist,4.8,4.4,110000,4184
OCC_02,2,DevOps Engineer,4.7,4.2,110000,2725
OCC_03,3,Data Engineer,4.7,4.3,106000,2599
OCC_04,4,Tax Manager,4.7,4.0,110000,3317

### Dataset-2 and Dataset 3 are SCUs MSIS Specialization Tracks and associated Course listings
Reference: https://www.scu.edu/business/ms-information-systems/curriculum/specialization-tracks/

Raw Datasets 2 & 3 prior to scraping:

![SCU-MSIS-Tacks_Raw.png](attachment:SCU-MSIS-Tacks_Raw.png)

Dataset-1 Final result after Excel Scraping

![SCU-MSIS-Tacks_Final.png](attachment:SCU-MSIS-Tacks_Final.png)

#### Dataset-2 - Read in "SCU MSIS Specialization Tracks"

In [19]:
dfTracks = pd.read_excel('SCU-MSIS-Curriculum.xlsx', sheetname='Tracks', header=0)
dfTracks.head(4)

   Track ID                MSIS Specialization Track
0       100  Business Intelligence / Analytics Track
1       200               Enterprise Computing Track
2       300                 Mobile Programming Track
3       400                  Computer Security Track

#### Dataset-3 - Read in "SCU MSIS Courses"

In [20]:
dfCourses = pd.read_excel('SCU-MSIS-Curriculum.xlsx', sheetname='Courses', header=0)
dfCourses.head(4)

   Track ID  Course ID                          Course Description
0       100  MSIS 2621  Business Intelligence and Data Warehousing
1       100  MSIS 2627             Big Data Modeling and Analytics
2       100  MSIS 2629   Dashboards, Scorecards, and Visualization
3       100  MSIS 2630                             Web Programming

#### Assign School name to SCU courses as "Santa Clara University"

In [21]:
dfCourses2 = dfCourses.copy()
dfCourses2['College_University'] = dfCourses['Track ID'].map(lambda x: 'Santa Clara University' if x > 0 else "")
dfCourses2.head(4)

,Track ID,Course ID,Course Description,College_University
0,100,MSIS 2621,Business Intelligence and Data Warehousing,Santa Clara University
1,100,MSIS 2627,Big Data Modeling and Analytics,Santa Clara University
2,100,MSIS 2629,"Dashboards, Scorecards, and Visualization",Santa Clara University
3,100,MSIS 2630,Web Programming,Santa Clara University

#### Assign an Occupation ID to eeach SCU MSIS Course based on external file containing Matrix Mapping

In [22]:
dfOccMatrix = pd.read_excel('D3_COURSE-OCCUPATION.xlsx', sheetname='MAIN', header=0)
dfOccMatrix.head(4)

   Track ID  Course ID Occupation ID
0       100  MSIS 2621        OCC_07
1       100  MSIS 2627        OCC_05
2       100  MSIS 2629        OCC_05
3       100  MSIS 2630        OCC_26

In [23]:
dfCourses2['Occupation ID'] = dfOccMatrix['Occupation ID']
dfCourses2.head(4)

,Track ID,Course ID,Course Description,College_University,Occupation ID
0,100,MSIS 2621,Business Intelligence and Data Warehousing,Santa Clara University,OCC_07
1,100,MSIS 2627,Big Data Modeling and Analytics,Santa Clara University,OCC_05
2,100,MSIS 2629,"Dashboards, Scorecards, and Visualization",Santa Clara University,OCC_05
3,100,MSIS 2630,Web Programming,Santa Clara University,OCC_26

### Dataset-4 - College Scorecard, Department of Education, ED.gov, 2015-2016 Dataset
Reference: https://catalog.data.gov/dataset/college-scorecard

#### Dataset-4 - Read in "College Scorecard" data from provided .csv file

In [24]:
dfScorecard = pd.read_csv('MERGED2015_16_PP.csv', header=0)
dfScorecard.head(4)

,UNITID,OPEID,OPEID6,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,NPCURL,...,D150_L4_WHITENH,D150_L4_BLACKNH,D150_L4_API,D150_L4_AIANOLD,D150_L4_HISPOLD,D_PCTPELL_PCTFLOAN,OPENADMP,UGNONDS,GRADS,ACCREDCODE
0,100654,100200,1002,Alabama A & M University,Normal,AL,35762,Southern Association of Colleges and Schools C...,www.aamu.edu/,www2.aamu.edu/scripts/netpricecalc/npcalc.htm,...,NaN,NaN,NaN,NaN,NaN,4210.0,2.0,NaN,1123.0,SACSCC
1,100663,105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,Southern Association of Colleges and Schools C...,www.uab.edu,uab.studentaidcalculator.com/survey.aspx,...,NaN,NaN,NaN,NaN,NaN,11679.0,2.0,242.0,6822.0,SACSCC
2,100690,2503400,25034,Amridge University,Montgomery,AL,36117-3553,Southern Association of Colleges and Schools C...,www.amridgeuniversity.edu,www2.amridgeuniversity.edu:9091/,...,NaN,NaN,NaN,NaN,NaN,279.0,1.0,NaN,319.0,SACSCC
3,100706,105500,1055,University of Alabama in Huntsville,Huntsville,AL,35899,Southern Association of Colleges and Schools C...,www.uah.edu,finaid.uah.edu/,...,NaN,NaN,NaN,NaN,NaN,5618.0,2.0,184.0,1853.0,SACSCC

Filter Scorecard Dataset to only include relevant columns needed for further analysis.

In [25]:
ColTable = pd.read_excel('CollegeScorecard_RelevantColumns.xlsx', sheetname='Columns', header=0)
ColTable.head(4)

  VARIABLE NAME
0        UNITID
1        INSTNM
2          CITY
3        STABBR

In [26]:
NeededColumns = ColTable['VARIABLE NAME'].tolist()
NeededColumns[:4]

[u'UNITID', u'INSTNM', u'CITY', u'STABBR']

In [27]:
dfScorecard2 = dfScorecard[NeededColumns]
dfScorecard2.head(4)

,UNITID,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,SCH_DEG,MAIN,NUMBRANCH,...,C150_4,RET_FT4,PAR_ED_PCT_1STGEN,FEMALE,ALIAS,C100_4,ICLEVEL,UGDS_MEN,UGDS_WOMEN,GRADS
0,100654,Alabama A & M University,Normal,AL,35762,Southern Association of Colleges and Schools C...,www.aamu.edu/,NaN,1,1,...,0.3081,0.5779,0.3887357227,0.5472427116,AAMU,0.1104,1,0.4617,0.5383,1123.0
1,100663,University of Alabama at Birmingham,Birmingham,AL,35294-0110,Southern Association of Colleges and Schools C...,www.uab.edu,NaN,1,1,...,0.5462,0.7864,0.3564593301,0.6369683532,NaN,0.3173,1,0.4116,0.5884,6822.0
2,100690,Amridge University,Montgomery,AL,36117-3553,Southern Association of Colleges and Schools C...,www.amridgeuniversity.edu,NaN,1,1,...,0.4000,0.6667,0.5285714286,0.6043956044,Southern Christian University |Regions University,0.0000,1,0.4286,0.5714,319.0
3,100706,University of Alabama in Huntsville,Huntsville,AL,35899,Southern Association of Colleges and Schools C...,www.uah.edu,NaN,1,1,...,0.4935,0.8025,0.3137931034,0.4779208832,UAH |University of Alabama Huntsville,0.1848,1,0.5740,0.4260,1853.0

Filter Scorecard Daset to only include "Masters Colleges & Universities" (CCBASIC = 18), "Main Campus" colleges (MAIN = 1), and Bachelor's degree in Computer And Information Sciences And Support Services (CIP11BACHL > 0) in order to compare only US Universities offering a related Undergraduate Program, and the Region is Far West (AK, CA, HI, NV, OR, WA) - (REGION = 8).

In [28]:
dfScorecard2 = dfScorecard2[((dfScorecard2['CCBASIC'] == 18) & (dfScorecard2['MAIN'] == 1) &
                             (dfScorecard2['REGION'] == 8) & (dfScorecard2['PCIP11'] > 0.0))]
dfScorecard2.head(4)

,UNITID,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,SCH_DEG,MAIN,NUMBRANCH,...,C150_4,RET_FT4,PAR_ED_PCT_1STGEN,FEMALE,ALIAS,C100_4,ICLEVEL,UGDS_MEN,UGDS_WOMEN,GRADS
60,102553,University of Alaska Anchorage,Anchorage,AK,99508,Northwest Commission on Colleges and Universities,www.uaa.alaska.edu,NaN,1,1,...,0.2408,0.7084,0.399125205,0.5957103321,UAA,0.0883,1,0.4280,0.5720,845.0
220,110361,California Baptist University,Riverside,CA,92504-3297,Western Association of Schools and Colleges Se...,www.calbaptist.edu,NaN,1,1,...,0.6046,0.7606,0.4054762598,0.6491318995,CBU,0.4376,1,0.3720,0.6280,1911.0
224,110413,California Lutheran University,Thousand Oaks,CA,91360-2787,Western Association of Schools and Colleges Se...,www.callutheran.edu/,NaN,1,1,...,0.6623,0.8417,0.3231046931,0.6237541528,NaN,0.6017,1,0.4254,0.5746,1316.0
225,110422,California Polytechnic State University-San Lu...,San Luis Obispo,CA,93407,Western Association of Schools and Colleges Se...,calpoly.edu,NaN,1,1,...,0.7578,0.9320,0.2516451101,0.4942528736,Cal Poly,0.4016,1,0.5339,0.4661,895.0

### Dataset-5 - Money Magazine's "Best Colleges for your Money 2017"
Reference: https://www.scu.edu/business/news/top-stories/leavey-school-ranked-10-in-the-country-for-undergraduate-business-by-money-magazine.html

Raw Dataset-5 as HTML prior to scraping:

![BestColleges.png](attachment:BestColleges.png)

Dataset-5 after Excel scraping:

![BestCollegesExcel.png](attachment:BestCollegesExcel.png)

#### Dataset-5 - Read in Money Magazine's 50 Best Colleges for 2017" data from Excel file

In [29]:
dfBestColleges = pd.read_excel('BestColleges_2017.xlsx', header=0)
dfBestColleges.head(4)

,Order,College Name,City and State,Money Ranking,Median SAT/ACT score,Est. price 2017-18 without aid,Est. price 2017-18 with avg. grant,% who get need-based grants,% who get merit grants,Business major early career earnings
0,1.0,University of California-Berkeley,"Berkeley, CA",4.0,1370/32,37220.0,17929.0,0.48,0.01,72100.0
1,2.0,Washington and Lee University,"Lexington, VA",16.0,1390/32,65737.0,23089.0,0.41,0.10,60000.0
2,3.0,University of Pennsylvania,"Philadelphia, PA",27.0,1460/33,71074.0,25838.0,0.47,NaN,69200.0
3,4.0,Brown University,"Providence, RI",34.0,1440/32,69809.0,24794.0,0.44,NaN,64100.0

## The 5 Datasets are ready for Tableau
1. D1_50BestJobs2017.csv
2. D2_SCUMSISTracks.csv
3. D3_SCUMSISCourses.csv
4. D4_CollegeScorecard201516.csv
5. D5_50BestColleges2017.csv

### Write Dataframes to .csv files

In [30]:
dfJobs.to_csv('D1_50BestJobs2017.csv', encoding='utf-8')
dfTracks.to_csv('D2_SCUMSISTracks.csv', encoding='utf-8')
dfCourses2.to_csv('D3_SCUMSISCourses.csv', encoding='utf-8')
dfScorecard2.to_csv('D4_CollegeScorecard201516.csv', encoding='utf-8')
dfBestColleges.to_csv('D5_50BestColleges2017.csv', encoding='utf-8')